# Importing libraries

In [1]:
import pandas as pd
import numpy as np
import getpass
import mysql.connector
import pymysql
from sqlalchemy import create_engine

# Login

In [2]:
saved_password = getpass.getpass()

········

# Creating database

In [3]:
cnx = mysql.connector.connect(user = 'root',
                        password = saved_password,
                        host = 'localhost')

In [4]:
cnx.is_connected()

True

In [8]:
cursor = cnx.cursor()

In [9]:
query = ('CREATE DATABASE restaurants;')

In [6]:
#query = ('DROP DATABASE restaurants;')

In [10]:
cursor.execute(query)

# Loading Google tables

In [35]:
#RESTAURANTS table first

In [11]:
restaurants = pd.read_csv('restaurants.csv')
restaurants.drop('Unnamed: 0', axis=1, inplace=True)

In [12]:
restaurants.head()

,result.name,result.place_id,result.business_status,result.website,price_level
0,Restaurante La Dehesa,ChIJe8y4CKAuQg0RC4YervOOVLg,OPERATIONAL,http://www.grupoladehesa.com/,2.0
1,Casa Corrochano,ChIJjWIe0PMrQg0RXJxYC8mlRcM,OPERATIONAL,https://www.casacorrochano.es/,1.0
2,Restaurante Aspen,ChIJa64cyBIsQg0RkVa57dm7oeY,OPERATIONAL,https://restauranteaspen.com/,4.0
3,La Máquina La Moraleja,ChIJwyguthIsQg0RKfP-___CUFI,OPERATIONAL,https://lamaquinalamoraleja.es/,3.0
4,La Mano de Pablo,ChIJmw6_CKAuQg0RY9Kcr3tR5OQ,OPERATIONAL,http://www.lamanodepablo.com/,2.0

In [14]:
restaurants['price_level'] = restaurants['price_level'].astype(int)

In [15]:
new_columns = ['name','place_id','business_status','website','price_level']

In [16]:
restaurants.columns = new_columns

In [25]:
cursor = cnx.cursor()

In [26]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.names(
place_id VARCHAR(255) PRIMARY KEY NOT NULL,
name VARCHAR(255),
business_status VARCHAR(255),
website VARCHAR(1024),
price_level INT 
)""")

In [23]:
#query = ('DROP TABLE restaurants.names;')

In [27]:
cursor.execute(query)

In [28]:
# import the module
from sqlalchemy import create_engine

# create sqlalchemy engine
engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=saved_password,
                               db="restaurants"))

In [29]:
restaurants.to_sql('names', con = engine, if_exists = 'append', chunksize = 1000, index= False)

5662

In [36]:
#Reviews

In [30]:
reviews = pd.read_csv('reviews.csv')
reviews.drop('Unnamed: 0',axis=1,inplace=True)

In [31]:
reviews.dropna(how='any',inplace=True)

In [32]:
reviews['rating_2'] = reviews['rating_2'].astype(int)
reviews['rating_3'] = reviews['rating_3'].astype(int)
reviews['rating_4'] = reviews['rating_4'].astype(int)
reviews['rating_5'] = reviews['rating_5'].astype(int)

In [33]:
reviews.columns

Index(['rating_1', 'description_1', 'rating_2', 'description_2', 'rating_3',
       'description_3', 'rating_4', 'description_4', 'rating_5',
       'description_5', 'restaurant_name', 'restaurant_place_ID'],
      dtype='object')

In [34]:
cursor = cnx.cursor()

In [35]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.reviews(
rating_1 INT NOT NULL,
description_1 TEXT,
rating_2 INT NOT NULL,
description_2 TEXT,
rating_3 INT NOT NULL,
description_3 TEXT,
rating_4 INT NOT NULL,
description_4 TEXT,
rating_5 INT NOT NULL,
description_5 TEXT,
restaurant_name VARCHAR(255),
restaurant_place_ID VARCHAR(255),
FOREIGN KEY (restaurant_place_ID) REFERENCES names(place_id))""")

In [72]:
#query = ('DROP TABLE restaurants.reviews;')

In [36]:
cursor.execute(query)

In [37]:
cursor = cnx.cursor()

In [38]:
query = ("""SET GLOBAL sql_mode='';""")

In [39]:
cursor.execute(query)

In [40]:
reviews.to_sql('reviews', con = engine, if_exists = 'append', chunksize = 1000, index= False)

5130

In [84]:
#Addresses

In [42]:
addresses = pd.read_csv('addresses.csv')
addresses.drop('Unnamed: 0', axis=1, inplace=True)
addresses.head()

,result.formatted_address,result.formatted_phone_number,result.name,result.place_id,zip_code
0,"C. San Juan de Ortega, 10, 28050 Madrid, Spain",913 07 52 88,Restaurante La Dehesa,ChIJe8y4CKAuQg0RC4YervOOVLg,28050
1,"Paseo de la, Zona, P.º de la Tierra de Melide,...",917 50 53 93,Casa Corrochano,ChIJjWIe0PMrQg0RXJxYC8mlRcM,28050
2,"Pl. de la Moraleja, 28109 Alcobendas, Madrid, ...",916 25 25 00,Restaurante Aspen,ChIJa64cyBIsQg0RkVa57dm7oeY,28109
3,"Pl. de la Moraleja, 1, 28109 Alcobendas, Madri...",916 58 52 97,La Máquina La Moraleja,ChIJwyguthIsQg0RKfP-___CUFI,28109
4,"C. de Frómista, 14, 28050 Madrid, Spain",914 27 09 45,La Mano de Pablo,ChIJmw6_CKAuQg0RY9Kcr3tR5OQ,28050

In [43]:
new_columns = ['address','phone_number','name','place_id','zip_code']

In [44]:
addresses.columns = new_columns

In [45]:
addresses.head()

,address,phone_number,name,place_id,zip_code
0,"C. San Juan de Ortega, 10, 28050 Madrid, Spain",913 07 52 88,Restaurante La Dehesa,ChIJe8y4CKAuQg0RC4YervOOVLg,28050
1,"Paseo de la, Zona, P.º de la Tierra de Melide,...",917 50 53 93,Casa Corrochano,ChIJjWIe0PMrQg0RXJxYC8mlRcM,28050
2,"Pl. de la Moraleja, 28109 Alcobendas, Madrid, ...",916 25 25 00,Restaurante Aspen,ChIJa64cyBIsQg0RkVa57dm7oeY,28109
3,"Pl. de la Moraleja, 1, 28109 Alcobendas, Madri...",916 58 52 97,La Máquina La Moraleja,ChIJwyguthIsQg0RKfP-___CUFI,28109
4,"C. de Frómista, 14, 28050 Madrid, Spain",914 27 09 45,La Mano de Pablo,ChIJmw6_CKAuQg0RY9Kcr3tR5OQ,28050

In [46]:
cursor = cnx.cursor()

In [47]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.addresses(
place_id VARCHAR(255),
name VARCHAR(255),
address VARCHAR(1024),
phone_number VARCHAR(255),
zip_code INT NOT NULL,
FOREIGN KEY (place_id) REFERENCES names(place_id)
)""")

In [101]:
#query = ('DROP TABLE restaurants.addresses;')

In [48]:
cursor.execute(query)

In [49]:
addresses.to_sql('addresses', con = engine, if_exists = 'append', chunksize = 1000, index= False)

5662

In [104]:
#Ratings

In [51]:
ratings = pd.read_csv('ratings_df.csv')
ratings.drop('Unnamed: 0',axis=1,inplace=True)
ratings.head()

,result.name,result.place_id,result.rating,result.user_ratings_total
0,Restaurante La Dehesa,ChIJe8y4CKAuQg0RC4YervOOVLg,4.0,1306.0
1,Casa Corrochano,ChIJjWIe0PMrQg0RXJxYC8mlRcM,4.1,599.0
2,Restaurante Aspen,ChIJa64cyBIsQg0RkVa57dm7oeY,4.2,597.0
3,La Máquina La Moraleja,ChIJwyguthIsQg0RKfP-___CUFI,4.2,2378.0
4,La Mano de Pablo,ChIJmw6_CKAuQg0RY9Kcr3tR5OQ,4.4,3674.0

In [52]:
columns = ['name','place_id','rating','user_ratings_total']
ratings.columns = columns

In [53]:
ratings.dtypes

name                   object
place_id               object
rating                float64
user_ratings_total    float64
dtype: object

In [54]:
cursor = cnx.cursor()

In [55]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.ratings(
place_id VARCHAR(255),
name VARCHAR(255),
rating FLOAT,
user_ratings_total FLOAT,
FOREIGN KEY (place_id) REFERENCES names(place_id)
)""")

In [56]:
cursor.execute(query)

In [57]:
ratings.to_sql('ratings', con = engine, if_exists = 'append', chunksize = 1000, index= False)

5662

In [115]:
#Attributes

In [79]:
attributes = pd.read_csv('rest_attributes.csv')
attributes.drop('Unnamed: 0', axis=1, inplace=True)
attributes.head()

,result.delivery,result.dine_in,result.place_id,result.reservable,result.serves_beer,result.serves_breakfast,result.serves_brunch,result.serves_dinner,result.serves_lunch,result.serves_vegetarian_food,...,food,restaurant,bar,store,meal_takeaway,cafe,meal_delivery,bakery,liquor_store,night_club
0,True,True,ChIJe8y4CKAuQg0RC4YervOOVLg,True,True,True,True,True,True,False,...,True,True,False,False,False,False,False,False,False,False
1,True,True,ChIJjWIe0PMrQg0RXJxYC8mlRcM,True,True,True,True,True,True,False,...,True,True,False,False,False,False,False,False,False,False
2,False,True,ChIJa64cyBIsQg0RkVa57dm7oeY,True,True,True,True,True,True,False,...,True,True,False,False,False,False,False,False,False,False
3,False,True,ChIJwyguthIsQg0RKfP-___CUFI,True,True,False,True,True,True,False,...,True,True,False,False,False,False,False,False,False,False
4,Unknown,True,ChIJmw6_CKAuQg0RY9Kcr3tR5OQ,True,True,False,True,True,True,False,...,True,True,False,False,False,False,False,False,False,False

In [80]:
attributes.dtypes

result.delivery                          object
result.dine_in                             bool
result.place_id                          object
result.reservable                        object
result.serves_beer                         bool
result.serves_breakfast                    bool
result.serves_brunch                       bool
result.serves_dinner                       bool
result.serves_lunch                        bool
result.serves_vegetarian_food              bool
result.serves_wine                         bool
result.takeout                             bool
result.wheelchair_accessible_entrance      bool
establishment                              bool
point_of_interest                          bool
food                                       bool
restaurant                                 bool
bar                                        bool
store                                      bool
meal_takeaway                              bool
cafe                                       bool
meal_delivery                              bool
bakery                                     bool
liquor_store                               bool
night_club                                 bool
dtype: object

In [81]:
attributes['result.delivery'] = attributes['result.delivery'].fillna(True)

In [82]:
attributes_columns = ['delivery', 'dine_in', 'place_id',
       'reservable', 'serves_beer', 'serves_breakfast',
       'serves_brunch', 'serves_dinner', 'serves_lunch',
       'serves_vegetarian_food', 'serves_wine', 'takeout',
       'wheelchair_accessible_entrance', 'establishment',
       'point_of_interest', 'food', 'restaurant', 'bar', 'store',
       'meal_takeaway', 'cafe', 'meal_delivery', 'bakery', 'liquor_store',
       'night_club']
attributes.columns = attributes_columns

In [83]:
attributes.dtypes

delivery                          object
dine_in                             bool
place_id                          object
reservable                        object
serves_beer                         bool
serves_breakfast                    bool
serves_brunch                       bool
serves_dinner                       bool
serves_lunch                        bool
serves_vegetarian_food              bool
serves_wine                         bool
takeout                             bool
wheelchair_accessible_entrance      bool
establishment                       bool
point_of_interest                   bool
food                                bool
restaurant                          bool
bar                                 bool
store                               bool
meal_takeaway                       bool
cafe                                bool
meal_delivery                       bool
bakery                              bool
liquor_store                        bool
night_club                          bool
dtype: object

In [130]:
#Converting boolean values to 1 if True and 0 if False to be able to pass them as BIT in SQL

In [84]:
attributes_bool = attributes.select_dtypes(include=['bool']).columns
attributes[attributes_bool] = attributes[attributes_bool].astype(int)

In [85]:
attributes['delivery'] = attributes['delivery'].replace({'True': 1, "Unknown": 0, 'False': 0})

In [94]:
attributes['reservable'] = attributes['reservable'].replace({'True': 1, "Unknown": 0, 'False': 0})

In [95]:
cursor = cnx.cursor()

In [96]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.attributes(
place_id VARCHAR(255),
delivery BIT,
dine_in BIT,
reservable BIT,
serves_beer BIT,
serves_breakfast BIT,
serves_brunch BIT,
serves_dinner BIT,
serves_lunch BIT,
serves_vegetarian_food BIT,
serves_wine BIT,
takeout BIT,
wheelchair_accessible_entrance BIT,
establishment BIT,
point_of_interest BIT,
food BIT,
restaurant BIT,
bar BIT,
store BIT,
meal_takeaway BIT,
cafe BIT,
meal_delivery BIT,
bakery BIT,
liquor_store BIT,
night_club BIT,
FOREIGN KEY (place_id) REFERENCES names(place_id)
)""")

In [97]:
cursor.execute(query)

In [98]:
attributes.to_sql('attributes', con = engine, if_exists = 'append', chunksize = 1000, index= False)

5662

# Public data tables

In [100]:
population = pd.read_csv('/Users/Usuario/demo/Ironhack/Final_Project/raw_data/public_data/poblacion_df.csv')
population.head()

,Unnamed: 0,Distrito,Unnamed: 2,0 a 15 años,16 a 64 años,65 años y más,80 años y más
0,7,CIUDAD DE MADRID,3286662,13.551470,66.166585,20.281946,7.100061
1,9,CENTRO,139682,7.361006,76.950502,15.688492,4.929769
2,10,ARGANZUELA,152638,11.794573,67.757046,20.448381,6.309700
3,11,RETIRO,117672,12.018152,61.409681,26.572167,8.782038
4,12,SALAMANCA,145457,10.904941,65.105151,23.989908,8.581918

In [101]:
population.drop('Unnamed: 0',axis=1,inplace=True)

In [102]:
population = population.drop(0)

In [103]:
population_columns = ['district', 'total_population', '0_to_15', '16_to_64',
       '65_to_80', '80+']
population.columns = population_columns

In [104]:
population['district'].unique()

array(['CENTRO', 'ARGANZUELA', 'RETIRO', 'SALAMANCA', 'CHAMARTIN',
       'TETUAN', 'CHAMBERI', 'FUENCARRAL-EL PARDO', 'MONCLOA-ARAVACA',
       'LATINA', 'CARABANCHEL', 'USERA', 'PUENTE DE VALLECAS',
       'MORATALAZ', 'CIUDAD LINEAL', 'HORTALEZA', 'VILLAVERDE',
       'VILLA DE VALLECAS', 'VICALVARO', 'SAN BLAS-CANILLEJAS', 'BARAJAS'],
      dtype=object)

In [105]:
income = pd.read_csv('renta_limpia_def.csv')
income.drop('Unnamed: 0', axis=1, inplace=True)
income.head()

        barrio distrito  renta_media_persona  renta_media_hogar  Cod_Postal
0      PALACIO   CENTRO                19643              39389       28005
1  EMBAJADORES   CENTRO                14965              30824       28005
2       CORTES   CENTRO                20256              40007       28005
3     JUSTICIA   CENTRO                23257              48352       28005
4  UNIVERSIDAD   CENTRO                18874              37187       28005

In [106]:
income_columns = ['neighborhood', 'district', 'avg_per_capita_income', 'avg_household_income',
       'zip_code']
income.columns = income_columns

In [107]:
income.dtypes

neighborhood             object
district                 object
avg_per_capita_income     int64
avg_household_income      int64
zip_code                  int64
dtype: object

In [108]:
#Income first

In [112]:
cursor = cnx.cursor()

In [123]:
# CREATE INDEX idx_address_id ON addresses (address_id);

In [113]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.income(
neighborhood VARCHAR(255),
district VARCHAR(255),
avg_per_capita_income INT,
avg_household_income INT,
zip_code INT NOT NULL,
FOREIGN KEY (zip_code) REFERENCES addresses(zip_code)
)""")

In [114]:
cursor.execute(query)

In [115]:
income.to_sql('income', con = engine, if_exists = 'append', chunksize = 1000, index= False)

130

In [166]:
#Population

In [116]:
population.rename({'80+':'80_'}, axis=1, inplace=True)

In [117]:
cursor = cnx.cursor()

In [122]:
# CREATE INDEX index_district ON restaurants.income (district);

In [118]:
query = ("""CREATE TABLE IF NOT EXISTS
restaurants.population(
district VARCHAR(255),
total_population INT NOT NULL,
0_to_15 FLOAT,
16_to_64 FLOAT,
65_to_80 FLOAT,
80_ FLOAT,
FOREIGN KEY (district) REFERENCES income(district)
)""")

In [120]:
cursor.execute(query)

In [121]:
population.to_sql('population', con = engine, if_exists = 'append', chunksize = 1000, index= False)

21